Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4N8C.xml
<?xml version="1.0" encoding="UTF-8"?><!-- ============================================================================ --><!--                  Atmel Microcontroller Software Support                      --><!--                       SAM Software Package License                           --><!-- ============================================================================ --><!-- Copyright (c) 2015, Atmel Corporation                                        --><!--                                                                              --><!-- All rights reserved.                                                         --><!--                                                                              --><!-- Redistribution and use in source and binary forms, with or without           --><!-- modification, are permitted provided that the following condition is met:    --><!--                                                                              --><!-- - Redistributions of source code must retain the above copyright notice,     --><!-- this list of conditions and the disclaimer below.                            --><!--                                                                              --><!-- Atmel's name may not be used to endorse or promote products derived from     --><!-- this software without specific prior written permission.                     --><!--                                                                              --><!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   --><!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF --><!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   --><!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      --><!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT --><!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  --><!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    --><!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         --><!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, --><!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           --><!-- ============================================================================ --><avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAM4N8C-AU" package="LQFP100" speedmax="120" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
    <variant ordercode="ATSAM4N8C-CU" package="TFBGA100" speedmax="120" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
    <variant ordercode="ATSAM4N8C-CFU" package="VFBGA100" speedmax="120" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M4" family="SAM4" name="ATSAM4N8C" series="SAM4N">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io"/>
          <memory-segment name="IFLASH" start="0x00400000" size="0x00080000" type="flash" pagesize="512"/>
          <memory-segment name="IROM" start="0x00800000" size="0x00400000" type="rom"/>
          <memory-segment name="IRAM" start="0x20000000" size="0x00010000" type="ram"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="1" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x8" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ADC" version="6489Q">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x40038000"/>
            <signals>
              <signal pad="PA8" function="B" group="ADTRG"/>
              <signal pad="PA17" function="X1" group="AD" index="0"/>
              <signal pad="PA18" function="X1" group="AD" index="1"/>
              <signal pad="PA19" function="X1" group="AD" index="2"/>
              <signal pad="PA19" function="X1" group="WKUP" index="9"/>
              <signal pad="PA20" function="X1" group="AD" index="3"/>
              <signal pad="PA20" function="X1" group="WKUP" index="10"/>
              <signal pad="PB0" function="X1" group="AD" index="4"/>
              <signal pad="PB1" function="X1" group="AD" index="5"/>
              <signal pad="PB2" function="X1" group="AD" index="6"/>
              <signal pad="PB2" function="X1" group="WKUP" index="12"/>
              <signal pad="PB3" function="X1" group="AD" index="7"/>
              <signal pad="PA21" function="X1" group="AD" index="8"/>
              <signal pad="PA22" function="X1" group="AD" index="9"/>
              <signal pad="PC13" function="X1" group="AD" index="10"/>
              <signal pad="PC15" function="X1" group="AD" index="11"/>
              <signal pad="PC12" function="X1" group="AD" index="12"/>
              <signal pad="PC29" function="X1" group="AD" index="13"/>
              <signal pad="PC30" function="X1" group="AD" index="14"/>
              <signal pad="PC31" function="X1" group="AD" index="15"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" version="6417O">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
          </instance>
        </module>
        <module name="DACC" version="11025C">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x4003C000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
          </instance>
        </module>
        <module name="EFC" version="6450J">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0A00"/>
            <parameters>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES_PR_REGION" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" version="6378D">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1490"/>
